stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_pka.h
#endif /* STM32WB05 || STM32WB09 */

#if defined (STM32WB09)
typedef struct
{
  uint32_t primeOrderSize;             /*!< curve prime order n length */
  uint32_t modulusSize;                /*!< curve modulus p length */
  uint32_t coefSign;                   /*!< curve coefficient a sign */
  const uint8_t *coefA;                /*!< pointer to curve coefficient |a| */
  const uint8_t *modulus;              /*!< pointer to curve modulus value p */
  const uint8_t *integerK;             /*!< pointer to cryptographically secure random integer k */
  const uint8_t *integerM;             /*!< pointer to cryptographically secure random integer m */
  const uint8_t *basePointX1;          /*!< pointer to curve base first point coordinate x */
  const uint8_t *basePointY1;          /*!< pointer to curve base first point coordinate y */
  const uint8_t *basePointZ1;          /*!< pointer to curve base first point coordinate z */
  const uint8_t *basePointX2;          /*!< pointer to curve base second point coordinate x */
  const uint8_t *basePointY2;          /*!< pointer to curve base second point coordinate y */
  const uint8_t *basePointZ2;          /*!< pointer to curve base second point coordinate z */
} PKA_ECCDoubleBaseLadderInTypeDef;

typedef struct
{
  uint32_t modulusSize;                /*!< curve modulus p length */
  uint32_t coefSign;                   /*!< curve coefficient a sign */
  const uint8_t *modulus;              /*!< pointer to curve modulus value p */
  const uint8_t *coefA;                /*!< pointer to curve coefficient |a| */
  const uint8_t *basePointX1;          /*!< pointer to curve base first point coordinate x */
  const uint8_t *basePointY1;          /*!< pointer to curve base first point coordinate y */
  const uint8_t *basePointZ1;          /*!< pointer to curve base first point coordinate z */
  const uint8_t *basePointX2;          /*!< pointer to curve base second point coordinate x */
  const uint8_t *basePointY2;          /*!< pointer to curve base second point coordinate y */
  const uint8_t *basePointZ2;          /*!< pointer to curve base second point coordinate z */
} PKA_ECCCompleteAdditionInTypeDef;

typedef struct
{
  uint8_t *ptX;                        /*!< Pointer to point P coordinate xP     (Array of modulusSize elements) */
  uint8_t *ptY;                        /*!< Pointer to point P coordinate yP     (Array of modulusSize elements) */
} PKA_ECCDoubleBaseLadderOutTypeDef;

typedef struct
{
  uint8_t *ptX;                        /*!< pointer to point P coordinate xP */
  uint8_t *ptY;                        /*!< pointer to point P coordinate yP */
  uint8_t *ptZ;                        /*!< pointer to point P coordinate zP */
} PKA_ECCCompleteAdditionOutTypeDef;
#endif /* STM32WB05 || STM32WB09 */
/**
  * @}
  */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup PKA_Exported_Constants PKA Exported Constants
  * @{
  */

/** @defgroup PKA_Mode PKA mode
  * @{
  */
#if defined (STM32WB06) || defined(STM32WB07)
#define PKA_MODE_ECC_MUL                          (0x00000020U)
#endif /* STM32WB06 || STM32WB07 */
#if defined (STM32WB05)|| defined(STM32WB09)
#define PKA_MODE_MONTGOMERY_PARAM                 (0x00000001U)
#define PKA_MODE_MODULAR_EXP                      (0x00000000U)
#define PKA_MODE_MODULAR_EXP_FAST_MODE            (0x00000002U)
#define PKA_MODE_ECC_MUL                          (0x00000020U)
#define PKA_MODE_ECC_MUL_FAST_MODE                (0x00000022U)
#define PKA_MODE_ECDSA_SIGNATURE                  (0x00000024U)
#define PKA_MODE_POINT_CHECK                      (0x00000028U)
#define PKA_MODE_RSA_CRT_EXP                      (0x00000007U)
#define PKA_MODE_MODULAR_INV                      (0x00000008U)
#define PKA_MODE_ARITHMETIC_ADD                   (0x00000009U)
#define PKA_MODE_ARITHMETIC_SUB                   (0x0000000AU)
#define PKA_MODE_ARITHMETIC_MUL                   (0x0000000BU)
#define PKA_MODE_COMPARISON                       (0x0000000CU)
#define PKA_MODE_MODULAR_RED                      (0x0000000DU)
#define PKA_MODE_MODULAR_ADD                      (0x0000000EU)
#define PKA_MODE_MODULAR_SUB                      (0x0000000FU)
#define PKA_MODE_MONTGOMERY_MUL                   (0x00000010U)
#endif /* STM32WB05 || STM32WB09 */
#if defined (STM32WB09)
#define PKA_MODE_ECDSA_VERIFICATION               (0x00000025U)
#define PKA_MODE_DOUBLE_BASE_LADDER               (0x00000027U)
#define PKA_MODE_ECC_COMPLETE_ADD                 (0x00000023U)
#endif /* STM32WB09 */
#if defined (STM32WB05)
#define PKA_MODE_ECDSA_VERIFICATION               (0x00000026U)
#endif /* STM32WB05 */
/**
  * @}
  */

/** @defgroup PKA_Interrupt_configuration_definition PKA Interrupt configuration definition
  * @brief PKA Interrupt definition
  * @{
  */
#if defined (STM32WB05)|| defined(STM32WB09)
#define PKA_IT_PROCEND                            PKA_CR_PROCENDIE
#define PKA_IT_ADDRERR                            PKA_CR_ADDRERRIE
#define PKA_IT_RAMERR                             PKA_CR_RAMERRIE
#endif /* STM32WB05 || STM32WB09 */

#if defined (STM32WB06) || defined(STM32WB07)
#define PKA_IT_PROCEND                            PKA_IEN_READY_EN
#define PKA_IT_ADDRERR                            PKA_IEN_ADDERR_EN
#define PKA_IT_RAMERR                             PKA_IEN_RAMERR_EN
#endif /* STM32WB06 || STM32WB07 */

/**
  * @}
  */

/** @defgroup PKA_Flag_definition PKA Flag definition
  * @{
  */
#if defined (STM32WB05)|| defined(STM32WB09)
#define PKA_FLAG_PROCEND                          PKA_SR_PROCENDF
#define PKA_FLAG_ADDRERR                          PKA_SR_ADDRERRF
#define PKA_FLAG_RAMERR                           PKA_SR_RAMERRF
#endif /* STM32WB05 || STM32WB09 */

#if defined (STM32WB06) || defined(STM32WB07)
#define PKA_FLAG_PROCEND                          PKA_ISR_PROC_END
#define PKA_FLAG_ADDRERR                          PKA_ISR_ADD_ERR
#define PKA_FLAG_RAMERR                           PKA_ISR_RAM_ERR
#endif /* STM32WB06 || STM32WB07 */
/**
  * @}
  */


/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/

/** @defgroup PKA_Exported_Macros PKA Exported Macros
  * @{
  */

/** @brief  Reset PKA handle state.
  * @param  __HANDLE__ specifies the PKA Handle
  * @retval None
  */
#if (USE_HAL_PKA_REGISTER_CALLBACKS == 1)
#define __HAL_PKA_RESET_HANDLE_STATE(__HANDLE__)                do{                                                   \
                                                                    (__HANDLE__)->State = HAL_PKA_STATE_RESET;       \
                                                                    (__HANDLE__)->MspInitCallback = NULL;            \
                                                                    (__HANDLE__)->MspDeInitCallback = NULL;          \
                                                                  } while(0)
#else
#define __HAL_PKA_RESET_HANDLE_STATE(__HANDLE__)                ((__HANDLE__)->State = HAL_PKA_STATE_RESET)
#endif /* USE_HAL_PKA_REGISTER_CALLBACKS */

/** @brief  Enable the specified PKA interrupt.
  * @param  __HANDLE__ specifies the PKA Handle
  * @param  __INTERRUPT__ specifies the interrupt source to enable.
  *        This parameter can be one of the following values:
  *            @arg @ref PKA_IT_PROCEND End Of Operation interrupt enable
  *            @arg @ref PKA_IT_ADDRERR Address error interrupt enable
  *            @arg @ref PKA_IT_RAMERR RAM error interrupt enable
  * @retval None
  */
#if defined (STM32WB06) || defined(STM32WB07)
#define __HAL_PKA_ENABLE_IT(__HANDLE__, __INTERRUPT__)          ((__HANDLE__)->Instance->IEN |= (__INTERRUPT__))
#endif /* STM32WB06 || STM32WB07 */
#if defined (STM32WB05)|| defined(STM32WB09)
#define __HAL_PKA_ENABLE_IT(__HANDLE__, __INTERRUPT__)          ((__HANDLE__)->Instance->CR |= (__INTERRUPT__))
#endif /* STM32WB05 || STM32WB09 */
/** @brief  Disable the specified PKA interrupt.
  * @param  __HANDLE__ specifies the PKA Handle
  * @param  __INTERRUPT__ specifies the interrupt source to disable.
  *        This parameter can be one of the following values:
  *            @arg @ref PKA_IT_PROCEND End Of Operation interrupt enable
  *            @arg @ref PKA_IT_ADDRERR Address error interrupt enable
  *            @arg @ref PKA_IT_RAMERR RAM error interrupt enable
  * @retval None
  */
#if defined (STM32WB06) || defined(STM32WB07)
#define __HAL_PKA_DISABLE_IT(__HANDLE__, __INTERRUPT__)         ((__HANDLE__)->Instance->IEN &= (~(__INTERRUPT__)))
#endif /* STM32WB06 || STM32WB07 */
#if defined (STM32WB05)|| defined(STM32WB09)
#define __HAL_PKA_DISABLE_IT(__HANDLE__, __INTERRUPT__)         ((__HANDLE__)->Instance->CR &= (~(__INTERRUPT__)))
#endif /* STM32WB05 || STM32WB09 */
/** @brief  Check whether the specified PKA interrupt source is enabled or not.
  * @param  __HANDLE__ specifies the PKA Handle
  * @param  __INTERRUPT__ specifies the PKA interrupt source to check.
  *        This parameter can be one of the following values:
  *            @arg @ref PKA_IT_PROCEND End Of Operation interrupt enable
  *            @arg @ref PKA_IT_ADDRERR Address error interrupt enable
  *            @arg @ref PKA_IT_RAMERR RAM error interrupt enable
  * @retval The new state of __INTERRUPT__ (SET or RESET)
  */
#if defined (STM32WB06) || defined(STM32WB07)
#define __HAL_PKA_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)      ((((__HANDLE__)->Instance->IEN\
                                                                   & (__INTERRUPT__)) == (__INTERRUPT__)) ? SET : RESET)
#endif /* STM32WB06 || STM32WB07 */
#if defined (STM32WB05)|| defined(STM32WB09)
#define __HAL_PKA_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)      ((((__HANDLE__)->Instance->CR\
                                                                   & (__INTERRUPT__)) == (__INTERRUPT__)) ? SET : RESET)
#endif /* STM32WB05 || STM32WB09 */
/** @brief  Check whether the specified PKA flag is set or not.
  * @param  __HANDLE__ specifies the PKA Handle
  * @param  __FLAG__ specifies the flag to check.
  *        This parameter can be one of the following values:
  *            @arg @ref PKA_FLAG_PROCEND End Of Operation
  *            @arg @ref PKA_FLAG_ADDRERR Address error
  *            @arg @ref PKA_FLAG_RAMERR RAM error
  * @retval The new state of __FLAG__ (SET or RESET)
  */
#if defined (STM32WB06) || defined(STM32WB07)
#define __HAL_PKA_GET_FLAG(__HANDLE__, __FLAG__)                (((((__HANDLE__)->Instance->ISR)\
                                                                   & (__FLAG__)) == (__FLAG__)) ? SET : RESET)
#endif /* STM32WB06 || STM32WB07 */
#if defined (STM32WB05)|| defined(STM32WB09)
#define __HAL_PKA_GET_FLAG(__HANDLE__, __FLAG__)                (((((__HANDLE__)->Instance->SR)\
                                                                   & (__FLAG__)) == (__FLAG__)) ? SET : RESET)
#endif /* STM32WB05 || STM32WB09 */

/** @brief  Clear the PKA pending flags which are cleared by writing 1 in a specific bit.
  * @param  __HANDLE__ specifies the PKA Handle
  * @param  __FLAG__ specifies the flag to clear.
  *          This parameter can be any combination of the following values:
  *            @arg @ref PKA_FLAG_PROCEND End Of Operation
  *            @arg @ref PKA_FLAG_ADDRERR Address error
  *            @arg @ref PKA_FLAG_RAMERR RAM error
  * @retval None
  */
#if defined (STM32WB06) || defined(STM32WB07)
#define __HAL_PKA_CLEAR_FLAG(__HANDLE__, __FLAG__)    do {                                                    \
                                                           SET_BIT((__HANDLE__)->Instance->ISR,(__FLAG__));   \
                                                           CLEAR_BIT((__HANDLE__)->Instance->ISR,(__FLAG__)); \
                                                         } while(0)
#endif /* STM32WB06 || STM32WB07 */
#if defined (STM32WB05)|| defined(STM32WB09)
#define __HAL_PKA_CLEAR_FLAG(__HANDLE__, __FLAG__)              ((__HANDLE__)->Instance->CLRFR = (__FLAG__))
#endif /* STM32WB05 || STM32WB09 */
#if defined (STM32WB05)|| defined(STM32WB09)
/** @brief  Enable the specified PKA peripheral.
  * @param  __HANDLE__ specifies the PKA Handle
  * @retval None
  */
#define __HAL_PKA_ENABLE(__HANDLE__)                            (SET_BIT((__HANDLE__)->Instance->CR,  PKA_CR_EN))

